addons/zjhj_mall/core/modules/mch/models/OrderMessageForm.php

SELECT * FROM `hjmall_order_message` `om` WHERE ((`om`.`store_id`=1) AND (`om`.`is_delete`=0) AND (`om`.`order_type` IN (0, 1, 2, 3, 4))) AND ((`om`.`is_read`=0) OR (`om`.`is_sound`=0)) ORDER BY `om`.`addtime` DESC LIMIT 5
---
    public function search()
    {
        if (!$this->validate()) {
            return $this->errorResponse;
        }
        $query = OrderMessage::find()->alias('om')->where([
            'om.store_id' => $this->store_id,
            'om.is_delete' => 0,
            'om.order_type' => [0, 1, 2, 3, 4]
        ]);
        if ($this->is_read) {
            $query->andWhere(['or',['om.is_read' => 0],['om.is_sound'=>0]]);
        }
        $count = $query->count();
        $pagination = new Pagination(['totalCount' => $count, 'pageSize' => $this->limit]);

        $list = $query->orderBy(['om.addtime' => SORT_DESC])
            ->limit($pagination->limit)
            ->offset($pagination->offset)
            ->asArray()
            ->all();