addons/zjhj_mall/core/modules/mch/controllers/Controller.php

SELECT * FROM `hjmall_wechat_app` WHERE `id`=1
---
    public function init()
    {
        $this->setAdminLoginUrl();
        parent::init();
        $this->store = Store::findOne([
            'id' => \Yii::$app->session->get('store_id'),
        ]);

        if (Yii::$app->admin->isGuest == false) {
            $this->is_we7 = false;
            $this->is_ind = true;
            $this->platform = 'ind';
            if (\Yii::$app->admin->id != $this->store->admin_id && \Yii::$app->admin->id != 1) {
                \Yii::$app->response->redirect(\Yii::$app->urlManager->createUrl(['admin/default/index']))->send();
                \Yii::$app->end();
            }
        }

        if (empty($this->store)) {
            $url = $_COOKIE['adminLoginUrl'];
            \Yii::$app->response->redirect($url)->send();
            \Yii::$app->end();
        }
        Yii::$app->store = $this->store;
        $this->wechat_app = WechatApp::findOne(['id' => $this->store->wechat_app_id]);

SELECT * FROM `hjmall_we7_user_auth` WHERE `we7_user_id`=1
---
            $this->is_we7 = true;
            $this->is_ind = false;
            $this->platform = 'we7';
            $we7_user_auth_model = We7UserAuth::findOne(['we7_user_id' => \Yii::$app->user->identity->we7_uid]);